# GetTopPlan2DComp

## Description
Gets the 2D component that is shown in Top/Plan view for a symbol definition or plug-in object.

**Table - components**

| Constant | component         |
|----------|------------------|
| 0        | Top              |
| 1        | Top and Bottom Cut|

```pascal
FUNCTION GetTopPlan2DComp(objectHandle : HANDLE): INTEGER;
```

```python
def vs.GetTopPlan2DComp(objectHandle):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHandle|HANDLE|Handle to the object.|

## Examples
```pascal
resultN := GetTopPlan2DComp(objectHandle);
```
```python
import vs

# Gets the 2D component that is shown in Top/Plan view for a symbol
# definition or plug-in object.
objectHandle = vs.FSActLayer()  # handle to the first selected object on the active layer

resultN = vs.GetTopPlan2DComp(objectHandle)
vs.Message('GetTopPlan2DComp returned: ' + str(resultN))
```

## See Also
VS Functions:
SetTopPlan2DComp
| Get2DComponentGroup
| Set2DComponentGroup

## Version
Availability: from Vectorworks 2019

## Category
* Objects - Custom